test/transfer_complete.xml

<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0"><soapenv:Header>
<cwmp:ID soapenv:mustUnderstand="1">test1234</cwmp:ID>
</soapenv:Header>
<soapenv:Body>
<cwmp:TransferComplete>
<CommandKey>upgrade</CommandKey>
<FaultStruct>
<FaultCode>9015</FaultCode>
<FaultString>Server not found</FaultString>
</FaultStruct>
<StartTime>0001-01-01T00:00:00Z</StartTime>
<CompleteTime>2023-04-15T12:04:34Z</CompleteTime>
</cwmp:TransferComplete>
</soapenv:Body>
</soapenv:Envelope>
